benchmark/old_outputs/single_thread/clock_new/zipf_8/2026-04-17T17:22:35-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 2026755
number of failed transactions: 0 (0.000%)
latency average = 0.178 ms
initial connection time = 2.791 ms
tps = 11259.913019 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 1 (targets 50.0% of total)
 - 1012291 transactions (49.9% of total)
 - number of transactions actually processed: 1012291 (tps = 5623.920311)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.078 ms
 - latency stddev = 0.013 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 1 (targets 50.0% of total)
 - 1014464 transactions (50.1% of total)
 - number of transactions actually processed: 1014464 (tps = 5635.992708)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.276 ms
 - latency stddev = 0.081 ms
ratio: .9963693433237408