benchmark/old_outputs/single_thread/clock_new/zipf_8/2026-04-17T17:28:35-04:00_9_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 4148503
number of failed transactions: 0 (0.000%)
latency average = 0.087 ms
initial connection time = 3.033 ms
tps = 23047.620839 (without initial connection time)
SQL script 1: pgscripts/zipfian_select.sql
 - weight: 9 (targets 90.0% of total)
 - 3733086 transactions (90.0% of total)
 - number of transactions actually processed: 3733086 (tps = 20739.710370)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.068 ms
 - latency stddev = 0.011 ms
SQL script 2: pgscripts/zipfian_update.sql
 - weight: 1 (targets 10.0% of total)
 - 415417 transactions (10.0% of total)
 - number of transactions actually processed: 415417 (tps = 2307.910469)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.249 ms
 - latency stddev = 0.134 ms
ratio: .9948766690199463